MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAK176/mcu.h
extern volatile __IPC46bits_t IPC46bits __asm__ ("IPC46") __attribute__((section("sfrs"), address(0xBF810420)));
extern volatile uint32_t        IPC46CLR __attribute__((section("sfrs"),address(0xBF810424)));
extern volatile uint32_t        IPC46SET __attribute__((section("sfrs"),address(0xBF810428)));
extern volatile uint32_t        IPC46INV __attribute__((section("sfrs"),address(0xBF81042C)));
#define IPC47 IPC47
extern volatile uint32_t   IPC47 __attribute__((section("sfrs"), address(0xBF810430)));
typedef union {
  struct {
    uint32_t U6EIS:2;
    uint32_t U6EIP:3;
    uint32_t :3;
    uint32_t U6RXIS:2;
    uint32_t U6RXIP:3;
    uint32_t :3;
    uint32_t U6TXIS:2;
    uint32_t U6TXIP:3;
    uint32_t :3;
    uint32_t SDHCIS:2;
    uint32_t SDHCIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits __asm__ ("IPC47") __attribute__((section("sfrs"), address(0xBF810430)));
extern volatile uint32_t        IPC47CLR __attribute__((section("sfrs"),address(0xBF810434)));
extern volatile uint32_t        IPC47SET __attribute__((section("sfrs"),address(0xBF810438)));
extern volatile uint32_t        IPC47INV __attribute__((section("sfrs"),address(0xBF81043C)));
#define IPC48 IPC48
extern volatile uint32_t   IPC48 __attribute__((section("sfrs"), address(0xBF810440)));
typedef union {
  struct {
    uint32_t GLCDIS:2;
    uint32_t GLCDIP:3;
    uint32_t :3;
    uint32_t GPUIS:2;
    uint32_t GPUIP:3;
    uint32_t :11;
    uint32_t CTMUIS:2;
    uint32_t CTMUIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC48bits_t;
extern volatile __IPC48bits_t IPC48bits __asm__ ("IPC48") __attribute__((section("sfrs"), address(0xBF810440)));
extern volatile uint32_t        IPC48CLR __attribute__((section("sfrs"),address(0xBF810444)));
extern volatile uint32_t        IPC48SET __attribute__((section("sfrs"),address(0xBF810448)));
extern volatile uint32_t        IPC48INV __attribute__((section("sfrs"),address(0xBF81044C)));
#define IPC49 IPC49
extern volatile uint32_t   IPC49 __attribute__((section("sfrs"), address(0xBF810450)));
typedef union {
  struct {
    uint32_t ADCEOSIS:2;
    uint32_t ADCEOSIP:3;
    uint32_t :3;
    uint32_t ADCARDYIS:2;
    uint32_t ADCARDYIP:3;
    uint32_t :3;
    uint32_t ADCURDYIS:2;
    uint32_t ADCURDYIP:3;
    uint32_t :3;
    uint32_t ADC0EIS:2;
    uint32_t ADC0EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC49bits_t;
extern volatile __IPC49bits_t IPC49bits __asm__ ("IPC49") __attribute__((section("sfrs"), address(0xBF810450)));
extern volatile uint32_t        IPC49CLR __attribute__((section("sfrs"),address(0xBF810454)));
extern volatile uint32_t        IPC49SET __attribute__((section("sfrs"),address(0xBF810458)));
extern volatile uint32_t        IPC49INV __attribute__((section("sfrs"),address(0xBF81045C)));
#define IPC50 IPC50
extern volatile uint32_t   IPC50 __attribute__((section("sfrs"), address(0xBF810460)));
typedef union {
  struct {
    uint32_t ADC1EIS:2;
    uint32_t ADC1EIP:3;
    uint32_t :3;
    uint32_t ADC2EIS:2;
    uint32_t ADC2EIP:3;
    uint32_t :3;
    uint32_t ADC3EIS:2;
    uint32_t ADC3EIP:3;
    uint32_t :3;
    uint32_t ADC4EIS:2;
    uint32_t ADC4EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC50bits_t;
extern volatile __IPC50bits_t IPC50bits __asm__ ("IPC50") __attribute__((section("sfrs"), address(0xBF810460)));
extern volatile uint32_t        IPC50CLR __attribute__((section("sfrs"),address(0xBF810464)));
extern volatile uint32_t        IPC50SET __attribute__((section("sfrs"),address(0xBF810468)));
extern volatile uint32_t        IPC50INV __attribute__((section("sfrs"),address(0xBF81046C)));
#define IPC51 IPC51
extern volatile uint32_t   IPC51 __attribute__((section("sfrs"), address(0xBF810470)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t ADCGRPEIS:2;
    uint32_t ADCGRPEIP:3;
    uint32_t :3;
    uint32_t ADC7EIS:2;
    uint32_t ADC7EIP:3;
    uint32_t :3;
    uint32_t ADC0WIS:2;
    uint32_t ADC0WIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC51bits_t;
extern volatile __IPC51bits_t IPC51bits __asm__ ("IPC51") __attribute__((section("sfrs"), address(0xBF810470)));
extern volatile uint32_t        IPC51CLR __attribute__((section("sfrs"),address(0xBF810474)));
extern volatile uint32_t        IPC51SET __attribute__((section("sfrs"),address(0xBF810478)));
extern volatile uint32_t        IPC51INV __attribute__((section("sfrs"),address(0xBF81047C)));
#define IPC52 IPC52
extern volatile uint32_t   IPC52 __attribute__((section("sfrs"), address(0xBF810480)));
typedef union {
  struct {
    uint32_t ADC1WIS:2;
    uint32_t ADC1WIP:3;
    uint32_t :3;
    uint32_t ADC2WIS:2;
    uint32_t ADC2WIP:3;
    uint32_t :3;
    uint32_t ADC3WIS:2;
    uint32_t ADC3WIP:3;
    uint32_t :3;
    uint32_t ADC4WIS:2;
    uint32_t ADC4WIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC52bits_t;
extern volatile __IPC52bits_t IPC52bits __asm__ ("IPC52") __attribute__((section("sfrs"), address(0xBF810480)));
extern volatile uint32_t        IPC52CLR __attribute__((section("sfrs"),address(0xBF810484)));
extern volatile uint32_t        IPC52SET __attribute__((section("sfrs"),address(0xBF810488)));
extern volatile uint32_t        IPC52INV __attribute__((section("sfrs"),address(0xBF81048C)));
#define IPC53 IPC53
extern volatile uint32_t   IPC53 __attribute__((section("sfrs"), address(0xBF810490)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t ADC7WIS:2;
    uint32_t ADC7WIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC53bits_t;
extern volatile __IPC53bits_t IPC53bits __asm__ ("IPC53") __attribute__((section("sfrs"), address(0xBF810490)));
extern volatile uint32_t        IPC53CLR __attribute__((section("sfrs"),address(0xBF810494)));
extern volatile uint32_t        IPC53SET __attribute__((section("sfrs"),address(0xBF810498)));
extern volatile uint32_t        IPC53INV __attribute__((section("sfrs"),address(0xBF81049C)));
#define OFF000 OFF000
extern volatile uint32_t   OFF000 __attribute__((section("sfrs"), address(0xBF810540)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF000bits_t;
